// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

package com.tigshop.bean.dto.job;

import lombok.Data;

/**
 * 单个同步请求DTO
 *
 * @author Tigshop团队
 * @create 2025年02月12日 15:00
 */
@Data
public class SingleSyncRequest {

    /**
     * 产品ID
     */
    private Long productId;

    /**
     * 是否删除操作
     */
    private Boolean delete = false;
}
