// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

package com.tigshop.bean.enums.decorate;

import lombok.Getter;

import java.util.Arrays;

/**
 * 装修类型
 *
 * @author Tigshop团队
 * @create 2024年12月03日 17:27
 */
@Getter
public enum PcNavigationType {
    TYPE_MAIN(1, "主导航"),
    TYPE_TOP_BAR(2, "顶部小导航"),
    TYPE_BOTTOM(3, "底部导航"),
    TYPE_SIDEBAR(4, "侧边导航");

    private final Integer code;
    private final String name;

    PcNavigationType(Integer code, String name) {
        this.code = code;
        this.name = name;
    }

    public static boolean isValidCode(int code) {
        return Arrays.stream(values())
                .anyMatch(status -> status.code == code);
    }

    /**
     * 根据类型编码获取类型
     *
     * @param code 类型编码
     * @return 类型
     */
    public static PcNavigationType getTypeCode(Integer code) {
        for (PcNavigationType type : values()) {
            if (type.getCode().equals(code)) {
                return type;
            }
        }
        return null;
    }
}
