// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

package com.tigshop.bean.feign.wechat;

import io.swagger.v3.oas.annotations.media.Schema;
import lombok.Data;

import java.util.List;

/**
 * 新增模板入参
 *
 * @author Tigshop团队
 * @create 2024年12月27日 14:23
 */
@Data
@Schema(description = "微信接口新增模板入参")
public class AddTemplateParam {
    @Schema(description = "模板标题 id，可通过接口获取，也可登录小程序后台查看获取")
    private String tid;

    @Schema(description = "开发者自行组合好的模板关键词列表")
    private List<Integer> kidList;

    @Schema(description = "服务场景描述，15个字以内")
    private String sceneDesc;
}
