// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+
package com.tigshop.bean.enums.order;

import lombok.Getter;

/**
 * @author Tigshop
 */
@Getter
public enum OrderType {
    /**
     * 普通订单
     */
    NORMAL(1, "普通订单"),
    /**
     * 拼团订单
     */
    PIN(2, "拼团订单"),
    /**
     * 兑换订单
     */
    EXCHANGE(3, "兑换订单"),
    /**
     * 砍价订单
     */
    BARGAIN(5, "砍价订单"),
    /**
     * 虚拟订单
     */
    VIRTUAL(6, "虚拟订单"),
    /**
     * 已支付订单
     */
    PAID(7, "付费商品订单"),
    /**
     * 卡券订单
     */
    CARD(8, "卡券订单");

    private final int code;
    private final String description;

    OrderType(int code, String description) {
        this.code = code;
        this.description = description;
    }

    /**
     * 判断一个值是否为有效的 code
     *
     * @param code 状态码
     * @return 如果 code 有效则返回 true；否则返回 false
     */
    public static boolean isValidCode(int code) {
        for (OrderType type : values()) {
            if (type.code == code) {
                return true;
            }
        }
        return false;
    }

    public static boolean getNoAfterSalesType(Integer type) {
        return type == 7 || type == 8;
    }
}
