// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+
package com.tigshop.bean.enums.order;

import lombok.Getter;

/**
 * @author Tigshop
 */
@Getter
public enum PayType {
    /**
     * 在线支付
     */
    ONLINE(1, "在线支付"),
    /**
     * 现金支付
     */
    CASH(2, "现金支付"),
    /**
     * 线下支付
     */
    OFFLINE(3, "线下支付");

    private final int code;
    private final String description;

    PayType(int code, String description) {
        this.code = code;
        this.description = description;
    }

    /**
     * 根据code获取支付类型名称
     *
     * @param code 支付类型代码
     * @return 支付类型名称
     */
    public static String getTypeName(Integer code) {
        for (PayType payType : values()) {
            if (payType.code == code) {
                return payType.getDescription();
            }
        }
        return "";
    }

    /**
     * 判断一个值是否为有效的 code
     *
     * @param code 状态码
     * @return 如果 code 有效则返回 true；否则返回 false
     */
    public static boolean isValidCode(int code) {
        for (PayType type : values()) {
            if (type.code == code) {
                return true;
            }
        }
        return false;
    }
}
