// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

package com.tigshop.service.lang;

import com.baomidou.mybatisplus.extension.plugins.pagination.Page;
import com.tigshop.bean.dto.lang.CurrencyDTO;
import com.tigshop.bean.dto.lang.CurrencyListDTO;
import com.tigshop.bean.model.lang.Currency;
import com.tigshop.bean.vo.setting.CurrencyVO;
import com.tigshop.service.common.BaseService;

import java.util.List;

/**
 * 货币管理接口
 *
 * @author Tigshop团队
 * @create 2024年12月30日 16:42
 */
public interface CurrencyService extends BaseService<Currency> {
    /**
     * 货币列表
     *
     * @param dto 查询条件
     * @return ListResVO
     */
    Page<CurrencyVO> list(CurrencyListDTO dto);

    /**
     * 创建货币
     *
     * @param dto 货币信息
     * @return boolean
     */
    boolean create(CurrencyDTO dto);

    /**
     * 更新货币
     *
     * @param dto 货币信息
     * @return boolean
     */
    boolean update(CurrencyDTO dto);

    /**
     * 删除货币
     *
     * @param id 货币id
     * @return boolean
     */
    CurrencyVO detail(Integer id);

    /**
     * 获取货币信息
     *
     * @return CurrencyVO
     */
    List<CurrencyVO> getCurrency();

}
