// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

package com.tigshop.bean.enums.product;

import lombok.Getter;

/**
 * 商品类型
 *
 * @author Tigshop团队
 * @create 2024年11月27日 09:45
 */
@Getter
public enum IntroType {
    /**
     * 精品
     */
    IS_BEST("is_best", "精品"),

    /**
     * 新品
     */
    IS_NEW("is_new", "新品"),

    /**
     * 热销
     */
    IS_HOT("is_hot", "热卖");

    private final String fieldName;
    private final String desc;

    IntroType(String fieldName, String desc) {
        this.fieldName = fieldName;
        this.desc = desc;
    }

    // 根据值获取枚举
    public static IntroType fromString(String fieldName) {
        //fieldName没有is_时，自动加上
        if (!fieldName.startsWith("is_")) {
            fieldName = "is_" + fieldName;
        }
        for (IntroType type : IntroType.values()) {
            if (type.getFieldName().equals(fieldName)) {
                return type;
            }
        }
        // 如果没有匹配项可以返回null，或者抛出异常
        return null;
    }
}
