// **---------------------------------------------------------------------+
// ** 文件
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

package com.tigshop.bean.enums.product;

import lombok.Getter;

/**
 * 商品类型
 *
 * @author Tigshop团队
 * @create 2024年11月27日 17:23
 */
@Getter
public enum ProductType {
    PRODUCT_TYPE_NORMAL(1,  "普通商品"),
    PRODUCT_TYPE_VIRTUAL(2,  "虚拟商品"),
    PRODUCT_TYPE_CARD(3,  "卡密商品"),
    PRODUCT_TYPE_PAID(4, "付费内容"),
    PRODUCT_TYPE_ON_SITE(5, "上门服务"),
    PRODUCT_TYPE_TO_STORE(6, "到店服务"),
    ;

    private final int code;
    private final String description;

    ProductType(int code, String description) {
        this.code = code;
        this.description = description;
    }

    public static ProductType fromCode(int code) {
        for (ProductType type : values()) {
            if (type.code == code) {
                return type;
            }
        }
        return null;
    }
}
