// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

package com.tigshop.common.constant.decorate;

/**
 * 首页分类栏常量
 *
 * @author Tigshop团队
 * @create 2024年12月04日 09:56
 */
public class MobileCatNavConstants {
    public static final String CATEGORY_ID_NOT_NULL = "首页分类栏名称不能为空";

    public static final String MOBILE_CAT_NAV_ID_NOT_NULL = "首页分类栏id不能为空";
}
