// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

package com.tigshop.common.constant.authority;

/**
 * 管理员角色常量
 *
 * @author Tigshop团队
 * @create 2025年01月14日 15:49
 */
public class AdminRoleConstants {
    // 角色不存在
    public static final String ROLE_NOT_EXIST = "角色不存在";
}
