// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+
package com.tigshop.service.setting;

import org.springframework.web.multipart.MultipartFile;

import java.io.InputStream;

/**
 * 本地存储服务
 *
 * @author Tigshop团队
 * @create 2025年01月08日 10:36
 */
public interface LocalStorageService {
    /**
     * 上传文件
     *
     * @param file 文件
     * @return 文件名
     */
    String upload(MultipartFile file, String filePath);

    /**
     * 上传文件
     *
     * @param inputStream 文件流
     * @return 文件名
     */
    String upload(InputStream inputStream, String filePath);
}
