// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

package com.tigshop.service.setting;

import com.tigshop.bean.dto.setting.MailTemplatesDTO;
import com.tigshop.bean.model.setting.MailTemplates;
import com.tigshop.bean.vo.setting.MailTemplatesVO;
import com.tigshop.service.common.BaseService;

import java.util.List;

/**
 * 邮箱模板
 *
 * @author Tigshop团队
 * @create 2024年12月24日 11:17
 */
public interface MailTemplatesService extends BaseService<MailTemplates> {
    /**
     * 邮箱模板列表
     *
     * @return List
     */
    List<MailTemplatesVO> mailTemplatesList();

    /**
     * 更新邮件模板
     *
     * @param dto 邮件模板实体
     */
    void updateMailTemplates(MailTemplatesDTO dto);

}
