// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

package com.tigshop.service.setting;

import com.baomidou.mybatisplus.extension.plugins.pagination.Page;
import com.tigshop.bean.dto.setting.MessageTypeDetailDTO;
import com.tigshop.bean.dto.setting.MessageTypeListDTO;
import com.tigshop.bean.model.setting.MessageType;
import com.tigshop.bean.vo.setting.MessageTypeListVO;
import com.tigshop.service.common.BaseService;

/**
 * 消息类型接口服务
 *
 * @author Tigshop团队
 * @create 2024年12月25日 16:41
 */
public interface MessageTypeService extends BaseService<MessageType> {
    /**
     * 列表
     *
     * @param dto 查询参数
     * @return ListResVO
     */
    Page<MessageTypeListVO> list(MessageTypeListDTO dto);

    /**
     * 详情
     *
     * @param id 主键
     * @return MessageTypeListVO
     */
    MessageTypeDetailDTO detail(Integer id);

    /**
     * 更新
     *
     * @param dto 更新参数
     * @return boolean
     */
    boolean update(MessageTypeDetailDTO dto);

    /**
     *  小程序模板生成
     */
    void miniProgramMessageTemplate();

    /**
     * 微信公众号模板生成
     */
    void wechatMessageTemplate();
}
