// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

package com.tigshop.common.constant.product;

/**
 * 商品分类常量
 *
 * @author Jayce
 * @create 2024年11月01日 10:07
 */
public class CategoryConstants {
    public static final String CATEGORY_NAME_NOT_NULL = "分类名称不能为空";
    public static final String CATEGORY_NAME_OVERLENGTH = "分类名称长度不能超过30";
}
