// **---------------------------------------------------------------------+
// ** 文件
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

package com.tigshop.service.oauth;

/**
 * 微信
 *
 * @author Tigshop团队
 * @create 2025年01月23日 17:08
 */
public interface WechatOAuthService {
    /**
     * 获取小程序二维码
     *
     * @param path      小程序页面路径
     * @param productId 商品ID
     * @return string
     */
    String getMiniCode(String path, Integer productId);

    /**
     * 获取公众号access_token
     * @return
     */
    String getMpAccessToken();

    /**
     * 获取小程序access_token
     * @return
     */
    String getMiniAccessToken();
}
