// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

package com.tigshop.common.constant.shop;

/**
 * 店铺资金变化常量
 *
 * @author Tigshop团队
 * @create 2024年12月04日 09:56
 */
public class AccountConstants {
    public static final String _NOT_NULL = "店铺资金变化名称不能为空";

    public static final String _OVER_LENGTH = "店铺资金变化名称长度不能超过50";

    public static final String ACCOUNT_ID_NOT_NULL = "店铺资金变化id不能为空";
}
