// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

package com.tigshop.common.constant.setting;

/**
 * 相册文件常量
 *
 * @author Tigshop团队
 * @create 2025年01月13日 15:22
 */
public class GalleryPicConstants {
    // 文件不存在
    public static final String FILE_NOT_EXIST = "文件不存在";

    // 无效的文件路径
    public static final String INVALID_FILE_PATH = "无效的文件路径";
}
