// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

package com.tigshop.common.constant.msg;

/**
 * 管理员消息常量
 *
 * @author Tigshop团队
 * @create 2024年12月04日 09:56
 */
public class AdminMsgConstants {

    public static final String ADMIN_MSG_ID_NOT_NULL = "管理员消息id不能为空";
}
